{
	"posts": [
		{
			"date": "24/01/2024",
			"title": "Happy New Year!",
			"post": "Here's to another year! I have been quite busy since my last update after finishing the Reel Riddle project. I went on a trip to Japan with my partner, built a few new keyboards, had my graduation ceremony, and have been learning more frameworks and languages while settling into full time work. I have been learning Spring Boot in Java as a backend web server framework and flutter for cross platform development. Once I get more confident in these and possible build a project with them, I would also like to learn the basics of the .NET ecosystem. My partner and I have also been climbing/bouldering more consistently and we are loving learning and improving.",
			"img": "https://i.imgur.com/KMoSDnN.jpg"
		},
		{
			"date": "08/09/2023",
			"title": "Reel Riddle (Part 3)",
			"post": "Reel Riddle was completed and deployed! Pretty happy with how it turned out, although I think the UI could be improved upon and there are definitely other areas of potential improvement (different ways of selecting movies - category focused play types such as genre or classics/decade focuses for example), better authentication using a library, better cheating prevention methods, point rewards for maintatining streaks). I set up a cron job for the first time to automatically refresh the movie database every month and select dates at which each movie will be the daily puzzle. Go check it out in the portfolio tab and get to the top of the leaderboards!"
		},
		{
			"date": "04/09/2023",
			"title": "Wasting Time on Unix Ricing",
			"post": "Some time last week, I made some upgrades to my PC and decided to order a SSD to try out using a linux OS. I have spent quite a bit of time configuring everything which took alot more effort than expected, but overall I'm happy with the product so far. I am interested to see if I will like it more than MacOS for development. I also spent some time configuring NeoVim from scratch as I have been using LunarVim (premade neovim config) and feel it has been worth it to learn how to configure my setup. Here's what my first rice looks like!",
			"img": "https://i.imgur.com/EFcT6TA.png"
		},
		{
			"date": "26/08/2023",
			"title": "Reel Riddle (Part 2)",
			"post": "Today I developed the basic API routes for play of the game and to automatically pull new movies from the TMDB API. Eventually I will set this endpoint to pull more than one page. Logic should be there to update the game for each new day but will need to test this tomorrow to be sure. I began work on the player UI also, and ran into some difficulties with the specifics/intricacies of nextjs in comparison to traditional react, but have managed to come up with something that works. I will look into how to optimize this later. I wanted to have a single character at a time sort of input which would also allow for a hint on how many letters/words the movie title has, but attempts to import components were difficult. I will try again to implement this using components next time I work on this (ran into difficulties with nextjs server vs client syntax on this), otherwise I will have to implement this from scratch."
		},
		{
			"date": "25/08/2023",
			"title": "Reel Riddle",
			"post": "Began development on my next web app! This application will be a movie guessing game where given some details about a movie (plot, cast, year, genres etc) you guess the movie title. A single puzzle will be avaliable per day similar to games such as wordle. Hints like cast will be locked behind some sort of cooldown system or reduce the amount of points gained for solving the riddle. There will also be some sort of leaderboard mechanic showing the ladder of top players in the world and your score. I originally wanted the hints to be a few emoji's relating to the movie (kong vs godzilla would give the hint gorilla emoji, lizard emoji etc). Looking into emoji translation modules and doing some testing, attempts at auto generating these types of hints based on movie data were not good. Also looked into some machine learning or AI solutions but these seem overcomplicated or require payment etc and are not always 100% accurate. This could be done in the future, however decided that other hints could work better / be more fun. Will post updates with how it goes!"
		},
		{
			"date": "25/08/2023",
			"title": "New Keycaps! MT3 Operator from Drop",
			"post": "Got some new keycaps! Love the legends with cause I can never remember the symbols for the number keys",
			"img": "https://i.imgur.com/IQWxqPo.jpg"
		},
		{
			"date": "21/08/2023",
			"title": "First Post",
			"post": "Welcome to my website! Check in soon to see more posts!"
		}
	]
}
